[
  {
    "event": "kickstart-docker",
    "dateAndTime": "14th March, 15:00 IST",
    "jsDate": "March 14 2021, 15:00:00",
    "eventName": "Kickstart Docker",
    "description": "Docker is an open platform for developing, shipping, and running applications. Docker enables you to separate your applications from your infrastructure so you can deliver software quickly. With Docker, you can manage your infrastructure in the same ways you manage your applications. By taking advantage of Docker’s methodologies for shipping, testing, and deploying code quickly, you can significantly reduce the delay between writing code and running it in production. In this session we would learn about Docker and applications.",
    "speakerName": "Jimesh Parekh",
    "designation": "Developer",
    "speakerImg": "https://media-exp1.licdn.com/dms/image/C4E03AQGl0n78RvChVg/profile-displayphoto-shrink_800_800/0/1593157633960?e=1622073600&v=beta&t=c37OnMEruCR8Jiy9z82clwIlpQrSBmnZ9IbwNQiP9oY",
    "posterUrl": "https://i.imgur.com/0Y3MrdY.png",
    "type": "workshop"
  },
  {
    "event": "developer-console",
    "dateAndTime": "13th March, 16:00 IST",
    "jsDate": "March 13 2021, 16:00:00",
    "eventName": "Hands on Developer Console",
    "description": "Code is prone to errors. You are absolutely  going to make errors, at least if you’re a human and not a robot. Users don’t see errors by default in the browser. So, if something goes wrong in the script, we won’t see what’s broken and can’t fix it. To figure out what the errors are and get a lot of other useful information about scripts, “Developer tools” have been embedded in browsers. The Developer Console is an integrated development environment with a collection of tools you can use to create, debug, and test applications. Ingenium presents to you a workshop on Developer Console.",
    "speakerName": "Harsh Shah",
    "designation": "Developer",
    "speakerImg": "https://media-exp1.licdn.com/dms/image/C5103AQH6X3msFxkIPA/profile-displayphoto-shrink_800_800/0/1571044344621?e=1622073600&v=beta&t=GwtfAk2zg-5su2W3S9uQ8-TpC8wFAyfhEB81lfQi6n4",
    "posterUrl": "https://i.imgur.com/B5d9eX5.png",
    "type": "workshop"
  },
  {
    "event": "ui-ux",
    "dateAndTime": "13th Feb, 21:00 IST",
    "jsDate": "Feb 13 2021, 21:00:00",
    "eventName": "A voyage into the UI/UX world",
    "description": "UI design and UX design are two of the most often confused and conflated terms in web and app design. The user interface(UI) is the graphical layout of an application. It consists of the buttons users click on, the text they read, the images, sliders, text entry fields and all the rest of the items the user interacts with. User experience(UX) of the application is determined by how users interact with it. UI designers are tasked with deciding how the UI will look, IX designers are in charge of determining how the UI operates. The session will include the basics of UI/UX and how are these related.",
    "speakerName": "Anmol Anubhai",
    "designation": "Developer",
    "speakerImg": "https://media-exp1.licdn.com/dms/image/C5603AQHoEgQgG0z8PQ/profile-displayphoto-shrink_800_800/0/1564106318622?e=1622073600&v=beta&t=66daZWxHmsgda7PlateHAU-FA88BCWaYYekqb3o9-aA",
    "posterUrl": "https://i.imgur.com/C40T31T.png",
    "type": "workshop"
  },
  {
    "event": "kickstart-iot",
    "dateAndTime": "21st March, 16:00 IST",
    "jsDate": "March 21 2021, 16:00:00",
    "eventName": "Kickstart IOT",
    "description": "If you wish to learn from the best and create something uber cool this season, Ingenium brings you the perfect opportunity! The Kickstart IoT workshop will introduce you to the world of Arduino microcontroller and will provide an opportunity to create an IoT device or system. The participants would be taught about Arduino and be given a hands-on implementation with various modules that work with it. Furthermore, the workshop will cover the connection with IBM Cloud by industry experts. No chance like now to learn this!",
    "speakerName": "Kevin Naik",
    "designation": "Developer",
    "speakerImg": "https://media-exp1.licdn.com/dms/image/C4E03AQESyx8qnnjtJA/profile-displayphoto-shrink_800_800/0/1596495044162?e=1622073600&v=beta&t=zdnVnKwT4jRd5NA19MWD4zPsfSIdwdADEPBi2d3u764",
    "posterUrl": "https://i.imgur.com/ZbXGjJT.png",
    "type": "workshop"
  },
  {
    "event": "kaggle-competition",
    "description": "Join Arpit Vaghela and special guests for an inside look at the latest updates and product announcements from GitHub.",
    "dateAndTime": "2nd April, 08:00 IST",
    "jsDate": "April 2 2021, 08:00:00",
    "eventName": "Ingenium Kaggle Competition",
    "rules": "1. Every participant must have a ​Kaggle​ account.<br> 2. Maximum allowed team size is ​3<br> 3. The competition will last for 2 weeks.<br>4. Each team will be able to make 10 submissions per day.<br>5. There will be a public leaderboard that will be available during thecompetition and a private leaderboard that will be the finalstandings. During the competition, each team will be put onto thepublic leaderboard and the private leaderboard will be madeavailable only at the end of the competition.<br>4. ​Each team will have to select one solution that they considerfinal which will be evaluated for the final standings.<br>5. ​Use of any publicly available library / package isallowed. Use of pretrained models is not permitted.",
    "certificatePolicy": "1. Every participant must have a ​Kaggle​ account.<br> 2. Maximum allowed team size is ​3<br> 3. The competition will last for 2 weeks",
    "prizes": "10K",
    "posterUrl": "https://i.imgur.com/LLs8Hm2.png",
    "type": "competition"
  },
  {
    "event": "e-treasure-hunt",
    "description": "Join Arpit Vaghela and special guests for an inside look at the latest updates and product announcements from GitHub.",
    "dateAndTime": "3rd April, 17:00 IST",
    "jsDate": "April 3 2021, 17:00:00",
    "eventName": "E-treasure Hunt",
    "rules": "<ol><li>It&rsquo;s a group event with a team size of 1-2 members</li><li>The team will have to solve the problem using given clues which require knowledge of data processing, database, programming, and web</li><li>Internet will be</li><li>You can attend the event from a laptop or mobile phone, but laptop is</li><li>You can use the tools you</li><li>Team members should be present 15 minutes before the event, late entries in the event will not be</li><li>The competition will be hosted online, mostly on Zoom(for queries) and Actionbound (for clues).</li></ol><p>NOTE:- There may be some change in the hosting platform of the event. So Stay tuned for further details</p>",
    "certificatePolicy": "<ol><li>Certificate of excellence will be awarded to the top 2</li><li>Certificate of participation will be given to all the teams qualified for the final except the top 2</li><li>Disqualified teams will not be considered for any</li></ol><p>NOTE:- Rules announced by the coordinators during the competition will be considered equally important as those announced earlier.</p>",
    "prizes": "10K",
    "posterUrl": "https://i.imgur.com/61cppdr.png",
    "type": "competition"
  },
  {
    "event": "iot-auction",
    "description": "An event where a team of participants will be given virtual currency and would indulge in an auction to buy sensors and equipment required to build a model or a prototype of a system. In the first part of the event, teams will bid for components, as well as for the problem statement that they want. There will be open as well as close bids. The rules of the auction will be conveyed at the time of the event. In the second part, the teams will have to build the prototype of a model/system using the components they have bought using the online platform Tinkercad. Judging will be done on the basis of clarity of idea and the usage of components.",
    "dateAndTime": "4th April, 10:00 IST",
    "jsDate": "April 4 2021, 10:00:00",
    "eventName": "IoT Auction",
    "rules": "<ol><li>No outside component is allowed. The participants strictly have to bid for each and every component they want to include in their project.</li><li>In the auction round, the decisions taken by the auctioneer will be the final No one can argue or overrule that.</li><li>No two teams are allowed to e change anything between</li><li>All the participants of the particular team have to be present during the whole Absence of any participant in any of the two rounds will not be acceptable.</li><li>No team can buy any component in the second round though it has remained unsold after the two rounds of the auction.</li><li>Participants have to make their prototype on Tinkercad No other software is allowed to be used.</li><li>Team members may communicate with each other while making the prototype using any platform they find However, the main auction, and presentation of the prototype will be done virtually using Zoom meetings.</li><li>For any queries or guidance for the prototype stage, team members can contact the volunteers via messaging them in the Discord room that will be allotted to each</li></ol><p><strong><u>Team Specifications:</u></strong></p><ol><li>Each team should consist of minimum 3, maximum 4 members.</li></ol>",
    "certificatePolicy": "<ol><li>Certificate of excellence along with appropriate prizes will be awarded to the top 3</li><li>Certificate of participation will be given to all the teams qualified for the final except the top 3</li><li>Disqualified teams will not be considered for any certificates</li></ol>",
    "prizes": "10K",
    "posterUrl": "https://i.imgur.com/sfEAKI4.png",
    "type": "competition"
  },
  {
    "event": "need-for-solution",
    "description": "The safety of workers and employees is of the utmost importance. Problems usually arise suddenly and hinder the production of the end product. Companies are regularly confronted with these problems and must address them cost-effectively while complying with the appropriate security standards. Test your problem solving and tactical skills to overcome these obstacles. Participants should prepare a presentation on the subject. The text of the issue will be announced 24 hours before the event.",
    "dateAndTime": "20th March, 13:00 IST",
    "jsDate": "March 20 2021, 13:00:00",
    "eventName": "Need for Solution",
    "rules": "<p><strong>Judging Criteria:</strong></p><ol><li>Sustainability of the solution.&nbsp;</li><li>How well planned and organized the solution is.&nbsp;</li><li>Thoroughly explained visual materials (charts/graphs etc.).&nbsp;</li><li>Limitations of the proposed solution.&nbsp;</li><li>Business plan on paper &ndash; should include preliminary market sizing a basic prototyping cost estimates.&nbsp;</li><li>Presentation skills&nbsp;</li></ol><p><strong>Team criteria and norms:</strong></p><ol><li>Effectiveness in addressing the questions from the audience.</li><li>There can be a maximum of 4 and minimum of 2 members in a team</li><li>Teams can have students from same/different year.</li><li>The time for preparation of the solution is same for all the teams.</li><li>In case a member of the registered team is absent for any reason, the team will have to inform the organizing committee at least 2 hours before the competition or else it will cause the whole team to disqualify.</li><li>For any queries, the participants will have to contact the organizing committee at least 4 hours before the commencement of the event.</li><li>The decision of the jury will be final and binding to all.</li><li>No arguments or challenges will be entertained.&nbsp;</li><li>The organizers have every right to remove, disqualify or in any way prevent a presentation from the demonstration.&nbsp;</li><li>The organizers can cancel or postpone the event as they see fit, and the information will be communicated to the participants.&nbsp;</li><li>Any team not adhering to the rules that are specified here, or communicated to the teams will be given a stern warning, and after misbehaviour will be disqualified.</li></ol>",
    "certificatePolicy": "<ol><li>All the team participating will receive certificate of participation.</li><li>Disqualified team will not receive any kind of certificate nor will they get refund.</li></ol>",
    "prizes": "10K",
    "posterUrl": "https://images.template.net/4999/Free-Concert-Event-Poster-Template.jpeg",
    "type": "competition"
  },
  {
    "event": "chemical-hunt",
    "description": "A quiz based event which contains the structure of testing wits, strategies and knowledge of a true Chemist/Chemical Engineer! One answer contains the key to another question or one question unlocks some other answer? If you and your team have the right chemistry with your knowledge and ability to use it at the right time, you will surely be able to crack this one! ",
    "dateAndTime": "20th March, 13:00 IST",
    "jsDate": "March 20 2021, 13:00:00",
    "eventName": "Chemical Hunt",
    "rules": "<ol><li>There can be a maximum of 3 members and a minimum of 2 members.</li><li>Single registration is also allowed, if it will be possible we would form a team for them.</li><li>Only team registrations are allowed.</li><li>Any act of cheating or influencing the decisions of other teams will result in disqualification from the competition with immediate effect.</li><li>Teams can have students from same/different year.</li><li>The decision of the jury will be final and binding to all.</li><li>No arguments or challenges will be entertained.&nbsp;</li><li>The organizers have every right to remove, disqualify or in any way prevent a presentation from the demonstration.&nbsp;</li><li>The organizers can cancel or postpone the event as they see fit, and the information will be communicated to the participants.&nbsp;</li><li>Any team not adhering to the rules that are specified here, or communicated to the teams will be given a stern warning, and after misbehaviour will be disqualified.</li></ol>",
    "certificatePolicy": "<ol><li>All the team participating will receive certificate of participation.</li><li>Disqualified team will not receive any kind of certificate nor will they get refund.</li></ol>",
    "prizes": "10K",
    "posterUrl": "https://images.template.net/4999/Free-Concert-Event-Poster-Template.jpeg",
    "type": "competition"
  },
  {
    "event": "road-to-treasure",
    "description": "Road to treasure is an ultimate competition where teams compete with each other to reach the treasure. If you are person who loves to solve pictorial question/riddles/quizzes then you should surely register here.",
    "dateAndTime": "20th March, 13:00 IST",
    "jsDate": "March 20 2021, 13:00:00",
    "eventName": "Road to Treasure",
    "rules": "<ol><li>There can be a maximum of 3 members and a minimum of 2 members per team.</li><li>Single registration is also allowed, if it will be possible we would form a team for them.</li><li>Only team registrations are allowed to participate.</li><li>Any act of cheating or influencing the decisions of other teams will result in disqualification from the competition with immediate effect.</li><li>Teams can have students from same/different year.</li><li>The decision of the jury will be final and binding to all.</li><li>No arguments or challenges will be entertained.&nbsp;</li><li>The organizers have every right to remove, disqualify or in any way prevent a presentation from the demonstration.&nbsp;</li><li>The organizers can cancel or postpone the event as they see fit, and the information will be communicated to the participants.&nbsp;</li><li>Any team not adhering to the rules that are specified here, or communicated to the teams will be given a stern warning, and after misbehaviour will be disqualified.</li></ol>",
    "certificatePolicy": "<ol><li>All the team participating will receive certificate of participation.</li><li>Disqualified team will not receive any kind of certificate nor will they get refund.</li></ol>",
    "prizes": "10K",
    "posterUrl": "https://images.template.net/4999/Free-Concert-Event-Poster-Template.jpeg",
    "type": "competition"
  }
]
